// pch.cpp: 미리 컴파일된 헤더에 해당하는 소스 파일

#include "framework.h"

// 미리 컴파일된 헤더를 사용하는 경우 
// 컴파일이 성공하려면 이 소스 파일이 필요합니다.


/*
앞으로의 일정:
DX에서 다뤄야할 남은 부분을 다루는 동시에
작업할 개인 포트폴리오 작업물의 준비를 해야함
그 작업물 = 무언가의 게임을 만들어 보는것

물론 완성품을 내라는 이야기는 아님
게임의 한 장면을 최대한 완성해보는것을 목표로 잡으면 됨

어떤것을 만들지는 자유로
2D기만 하면 DX를 써도 OK,API로 만들어도 OK

그러나 맨땅에서 갑자기 게임을 만들어보라 한들,뭘 만들어야 할지 감을 잡을수 없음
따라서,처음부터 게임을 구상하지 말고
벤치마킹할 게임을 찾아보길 권함

과제:어떤 게임을 참조하여 게임을 만들기를 원하는지,
다음 내용들을 적어 게시판에 제출

기한:~8/2
내용:
1.만들고자 하는 게임의 장르

2.그 장르에서 참고하고자 할 게임
혹은 비슷하게 만들어보는것을 도전할 게임

3.그 게임을 만들고자 할때,우선적으로 구축해야 하는것이 무엇인지
이를 분석한 내용

4.이번 기간에 작업할 일정 내지 TO-DO LIST 작성
(= 제일먼저 어떤것을 만들것인지 + 이번 기간동안 어디까지 진행될것이라 예상 되는지)



*/